#include<iostream>
using namespace std;

int main()
{
	//经典for循环
	/*格式： for（初始化语句；条件；表达式）
				 语句                    */
				 //初始化语句：负责初始化一个变量，这个变量值会随循环迭代而改变，就是“循环变量”
				 //条件：条件为真则循环继续
				 //表达式：会在本次循环结束后再执行，一般会对循环变量进行更改
				 //可以根据需求进行省略，如要省略，需保存一个空语句

	cout << "循环开始……\n" << endl;
	for (int i(1); i <= 10; i++)
	{
		cout << "hello world" << endl;
		cout << "现在是第" << i << "次循环\n" << endl;
	}
	cout << "循环结束……" << endl;
	cout << "————————————————————————————————" << endl;

	//范围for循环   特点：不需要循环变量
	/*格式：for（声明：序列表达式）
				 语句           */

	for (int num : {1, 2, 4, 5, 7, 8})
	{
		cout << "序列中现在输出的数据是： " << num << endl;
	}

}